Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::CableCarrierPortDefault::Modifier Class Reference
MEP Element Manager
Modifier of the CableCarrierPortDefault. More...
#include <MEPCableCarrierPortDefault.hpp>
 Inheritance diagram for ACAPI::MEP::CableCarrierPortDefault::Modifier:
 Public Member Functions
void  | SetHeight (double height)
Sets the height of the CableCarrierPort.
 Public Member Functions inherited from ACAPI::MEP::PortDefaultBase::Modifier
void  | SetWidth (double width)
Sets the width of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Protected Member Functions
Modifier (CableCarrierPortDefault &parent)
Constructs a Modifier with the given CableCarrierPortDefault parent.
 Protected Member Functions inherited from ACAPI::MEP::PortDefaultBase::Modifier
Modifier (PortDefaultBase &parent)
Constructs a Modifier with the given PortDefaultBase parent.
Detailed Description
Modifier of the CableCarrierPortDefault.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::CableCarrierPortDefault::Modifier::Modifier  |  ( |  CableCarrierPortDefault & |  parent | )
protected
Constructs a Modifier with the given CableCarrierPortDefault parent.
Parameters
parent | The parent CableCarrierPortDefault.
Member Function Documentation
◆ SetHeight()
 void ACAPI::MEP::CableCarrierPortDefault::Modifier::SetHeight  |  ( |  double |  height | )
Sets the height of the CableCarrierPort.
Parameters
height | The value to be set.